{
  "javascript": [
    "What is closure in JavaScript?",
    "Explain event bubbling and event capturing in JavaScript.",
    "What is the difference between '==' and '===' in JavaScript?",
    "How does prototypal inheritance work in JavaScript?",
    "What are the different ways to declare variables in JavaScript?",
    "What is the use of 'use strict' in JavaScript?",
    "What is the difference between 'null' and 'undefined' in JavaScript?",
    "What are the different data types in JavaScript?",
    "What is the purpose of the 'this' keyword in JavaScript?",
    "Explain the concept of hoisting in JavaScript.",
    "What are callbacks in JavaScript?",
    "What is the event loop in JavaScript?",
    "Explain the difference between let, const, and var in JavaScript.",
    "What are arrow functions in JavaScript?",
    "What is destructuring assignment in JavaScript?",
    "What is the spread operator in JavaScript and how is it used?",
    "What are promises in JavaScript and how do they work?",
    "Explain async/await in JavaScript.",
    "What is the difference between synchronous and asynchronous programming in JavaScript?",
    "How can you handle errors in JavaScript?",
    "What are modules in JavaScript and why are they used?",
    "What is the difference between 'map', 'filter', and 'reduce' in JavaScript?",
    "Explain the difference between 'nullish coalescing operator (??)' and 'logical OR (||)' in JavaScript.",
    "What is the role of the 'constructor' property in JavaScript?",
    "What is 'strict mode' in JavaScript and why is it used?",
    "How do you create a JavaScript class?",
    "What are closures and how do they work in JavaScript?",
    "What are the different ways to define and invoke a function in JavaScript?",
    "What is 'promise chaining' in JavaScript?",
    "Explain the concept of 'prototype' in JavaScript.",
    "What is 'Object.create()' in JavaScript?",
    "How do you handle asynchronous code in JavaScript?",
    "What is 'function composition' in JavaScript?",
    "What are the different types of loops in JavaScript?",
    "Explain the concept of 'currying' in JavaScript.",
    "What is the difference between 'hasOwnProperty' and 'in' in JavaScript?",
    "What is the use of 'Object.keys()' in JavaScript?",
    "How do you handle exceptions in JavaScript?",
    "What are 'generators' in JavaScript?",
    "Explain the difference between 'apply' and 'call' in JavaScript.",
    "What is 'method chaining' in JavaScript?",
    "What is 'memoization' in JavaScript and how is it implemented?",
    "How do you clone an object in JavaScript?",
    "What is the purpose of the 'delete' operator in JavaScript?",
    "What is 'double equals' (==) coercion in JavaScript?",
    "How do you compare two objects in JavaScript?",
    "What is the difference between 'slice' and 'splice' in JavaScript?",
    "Explain the concept of 'event delegation' in JavaScript."
  ],
  "python": [
    "What are decorators in Python?",
    "What is the difference between '==' and 'is' in Python?",
    "Explain the use of generators in Python.",
    "What is the difference between lists and tuples in Python?",
    "What are the different ways to handle exceptions in Python?",
    "How does inheritance work in Python?",
    "What is the purpose of the 'self' parameter in Python?",
    "How do you open and read files in Python?",
    "Explain the difference between 'append()' and 'extend()' methods in Python lists.",
    "What are lambda functions in Python and how are they used?"
  ],
  "jenkins": [
    "What is Jenkins and how does it work?",
    "Explain the concept of Jenkins pipelines.",
    "What are Jenkins plugins and how do they extend its functionality?",
    "How do you trigger a Jenkins build?",
    "What is Jenkinsfile and how is it used in Jenkins pipelines?",
    "What are the different types of builds in Jenkins?",
    "Explain the role of Jenkins agents in distributed builds.",
    "How do you configure security in Jenkins?",
    "What is the purpose of Jenkins nodes and how are they configured?",
    "How can you integrate Jenkins with version control systems like Git?"
  ],
  "docker": [
    "What is Docker and how does it differ from virtual machines?",
    "Explain Dockerfile and Docker Compose.",
    "What is a Docker container and how is it different from an image?",
    "How does Docker networking work?",
    "What are Docker volumes and why are they used?",
    "How do you manage Docker containers?",
    "What is Docker Swarm and how does it work?",
    "What are Docker registries and why are they important?",
    "How do you scale Docker containers?",
    "Explain the concept of Docker orchestration."
  ],
  "travis-ci": [
    "What is Travis CI and how does it work?",
    "How do you configure Travis CI for a project?",
    "What are build stages in Travis CI?",
    "What is the difference between matrix builds and build stages in Travis CI?",
    "How do you trigger builds in Travis CI?",
    "What are cache dependencies in Travis CI?",
    "How do you encrypt sensitive data in Travis CI configurations?",
    "What is the Travis CI Marketplace and how does it work?",
    "How do you use Travis CI for continuous deployment?",
    "What is the Travis CI CLI and how is it used?"
  ],
  "circle-ci": [
    "What is CircleCI and how does it work?",
    "How do you configure CircleCI for a project?",
    "What are workflows in CircleCI?",
    "How do you trigger builds in CircleCI?",
    "What are orbs in CircleCI?",
    "How do you define custom jobs in CircleCI configurations?",
    "What is the CircleCI CLI and how is it used?",
    "What are the different types of contexts in CircleCI?",
    "How do you parallelize jobs in CircleCI?",
    "What are executors in CircleCI and how are they used?"
  ],
  "gitlab-ci": [
    "What is GitLab CI/CD and how does it work?",
    "How do you define pipelines in GitLab CI?",
    "What are stages and jobs in GitLab CI pipelines?",
    "How do you define variables in GitLab CI configurations?",
    "What are GitLab CI artifacts and how are they used?",
    "How do you trigger GitLab CI pipelines manually?",
    "What are GitLab CI runners and how are they configured?",
    "How do you define conditional execution of jobs in GitLab CI?",
    "What are GitLab CI environments and how are they used?",
    "How do you configure GitLab CI caching for dependencies?"
  ],
  "bamboo": [
    "What is Bamboo CI/CD and how does it work?",
    "How do you create build plans in Bamboo?",
    "What are Bamboo agents and how are they used?",
    "How do you configure deployment projects in Bamboo?",
    "What are the different types of Bamboo tasks?",
    "How do you define triggers and dependencies in Bamboo?",
    "What is the Bamboo Specs language and how is it used?",
    "How do you integrate Bamboo with other tools and systems?",
    "What are Bamboo variables and how are they managed?",
    "How do you analyze build results and logs in Bamboo?"
  ],
  "teamcity": [
    "What is TeamCity and how does it work?",
    "How do you set up build configurations in TeamCity?",
    "What are build agents in TeamCity and how are they utilized?",
    "How do you configure version control settings in TeamCity?",
    "What are build triggers and how do you define them in TeamCity?",
    "Explain the concept of build artifacts in TeamCity.",
    "What are build templates and how do they simplify configuration in TeamCity?",
    "How do you manage user permissions and roles in TeamCity?",
    "What is the TeamCity REST API and how can it be used?",
    "How do you monitor and analyze build results in TeamCity?"
  ],
  "azure-devops": [
    "What is Azure DevOps and how does it work?",
    "Explain the concept of pipelines in Azure DevOps.",
    "How do you create and configure build pipelines in Azure DevOps?",
    "What are release pipelines and how are they used in Azure DevOps?",
    "How do you set up and manage permissions in Azure DevOps?",
    "What are service connections and how do you use them in Azure DevOps?",
    "Explain the use of variables and expressions in Azure DevOps pipelines.",
    "What is YAML pipeline and how is it used in Azure DevOps?",
    "How do you integrate Azure DevOps with version control systems like Git?",
    "What are the different types of triggers available in Azure DevOps pipelines?"
  ],
  "github-actions": [
    "What are GitHub Actions and how do they work?",
    "How do you create workflows in GitHub Actions?",
    "Explain the syntax and structure of a GitHub Actions workflow file.",
    "What are jobs and steps in GitHub Actions workflows?",
    "How do you trigger workflows based on events in GitHub repositories?",
    "What are actions and how are they used in GitHub Actions?",
    "How do you use environment variables in GitHub Actions workflows?",
    "Explain the concept of caching in GitHub Actions.",
    "How do you schedule workflows to run at specific times in GitHub Actions?",
    "What are self-hosted runners and how do you configure them in GitHub Actions?"
  ],
  "bitbucket-pipelines": [
    "What are Bitbucket Pipelines and how do they work?",
    "How do you define pipelines in Bitbucket?",
    "Explain the structure and syntax of a Bitbucket-pipelines.yml file.",
    "What are steps and how are they used in Bitbucket Pipelines?",
    "How do you trigger pipelines in Bitbucket?",
    "What are artifacts in Bitbucket Pipelines?",
    "How do you use variables and secrets in Bitbucket Pipelines?",
    "Explain the concept of caching in Bitbucket Pipelines.",
    "How do you schedule pipelines to run at specific times in Bitbucket?",
    "What are custom pipelines and how are they configured in Bitbucket?"
  ],
  "codefresh": [
    "What is Codefresh and how does it work?",
    "Explain the concept of pipelines in Codefresh.",
    "How do you define and configure pipelines in Codefresh?",
    "What are triggers and how are they used in Codefresh?",
    "How does Codefresh handle versioning of Docker images?",
    "What are environments and how are they managed in Codefresh?",
    "Explain how Codefresh integrates with version control systems like GitHub.",
    "What are pipeline steps and how are they executed in Codefresh?",
    "How do you deploy applications using Codefresh?",
    "What are reusable components in Codefresh and how are they created?"
  ],
  "drone": [
    "What is Drone and how does it work?",
    "Explain the concept of Drone pipelines.",
    "How do you define and configure pipelines in Drone?",
    "What are triggers and how are they used in Drone?",
    "How does Drone handle versioning of Docker images?",
    "What are environments and how are they managed in Drone?",
    "Explain how Drone integrates with version control systems like GitHub.",
    "What are pipeline steps and how are they executed in Drone?",
    "How do you deploy applications using Drone?",
    "What are secrets in Drone and how are they managed?"
  ],
  "spinnaker": [
    "What is Spinnaker and how does it work?",
    "Explain the concept of Spinnaker pipelines.",
    "How do you define and configure pipelines in Spinnaker?",
    "What are triggers and how are they used in Spinnaker?",
    "How does Spinnaker handle deployments to different cloud providers?",
    "What are stages and how are they managed in Spinnaker pipelines?",
    "Explain how Spinnaker integrates with Kubernetes.",
    "What are deployment strategies supported by Spinnaker?",
    "How do you manage application releases using Spinnaker?",
    "What are the benefits of using Spinnaker for continuous delivery?"
  ],
  "concourse-ci": [
    "What is Concourse CI and how does it work?",
    "Explain the concept of pipelines in Concourse CI.",
    "How do you define and configure pipelines in Concourse CI?",
    "What are resources and how are they used in Concourse CI pipelines?",
    "What are tasks and how are they executed in Concourse CI?",
    "How does Concourse CI handle dependency management between jobs?",
    "What are the different types of triggers supported by Concourse CI?",
    "How do you scale Concourse CI workers?",
    "Explain how Concourse CI integrates with version control systems.",
    "What are the advantages of using Concourse CI for continuous integration and delivery?"
  ],
  "kubernetes": [
    "What is Kubernetes and how does it work?",
    "Explain the concept of Pods in Kubernetes.",
    "What are Kubernetes Services and how do they work?",
    "How does Kubernetes manage containerized applications?",
    "What is the difference between Kubernetes Deployment and StatefulSet?",
    "How do you scale applications in Kubernetes?",
    "Explain the role of Kubernetes ConfigMaps and Secrets.",
    "What is Kubernetes Ingress and how does it work?",
    "How does Kubernetes handle storage?",
    "What are Kubernetes Operators and what is their purpose?"
  ],
  "openshift": [
    "What is OpenShift and how does it differ from Kubernetes?",
    "Explain the architecture of OpenShift.",
    "How does OpenShift manage containerized applications?",
    "What are OpenShift Projects and how are they used?",
    "What is the difference between OpenShift Origin and OpenShift Enterprise?",
    "How does OpenShift handle networking?",
    "What is the role of OpenShift Operators?",
    "Explain the concept of Routes in OpenShift.",
    "How does OpenShift support CI/CD pipelines?",
    "What are the benefits of using OpenShift for application deployment?"
  ],
  "vault": [
    "What is HashiCorp Vault and what problem does it solve?",
    "Explain the key features of HashiCorp Vault.",
    "How does HashiCorp Vault handle secret management?",
    "What is the difference between dynamic and static secrets in Vault?",
    "What authentication methods does HashiCorp Vault support?",
    "How does Vault's encryption work?",
    "What are Vault policies and how are they used?",
    "Explain the concept of Vault's secret engines.",
    "How does Vault handle access control?",
    "What are the different deployment options for HashiCorp Vault?"
  ],
  "ansible": [
    "What is Ansible and how does it differ from other configuration management tools?",
    "Explain Ansible's architecture and components.",
    "What are Ansible playbooks and how are they used?",
    "How does Ansible handle idempotency?",
    "What are Ansible roles and why are they useful?",
    "Explain the inventory file in Ansible.",
    "What are Ansible modules and how are they used?",
    "How does Ansible handle task execution on remote hosts?",
    "What are Ansible facts and how are they collected?",
    "How does Ansible ensure security during automation tasks?"
  ],
  "mysql": [
    "What is MySQL and how does it differ from other relational databases?",
    "Explain the basic structure of a MySQL database.",
    "What are the different data types supported by MySQL?",
    "How does MySQL handle transactions?",
    "What is the purpose of indexing in MySQL?",
    "Explain the difference between MyISAM and InnoDB storage engines in MySQL.",
    "How do you optimize MySQL queries for better performance?",
    "What are the different methods for backing up and restoring MySQL databases?",
    "How does MySQL handle user authentication and authorization?",
    "What are the advantages and disadvantages of using MySQL?"
  ],
  "postgresql": [
    "What is PostgreSQL and how does it differ from other relational databases?",
    "Explain the basic structure of a PostgreSQL database.",
    "What are the different data types supported by PostgreSQL?",
    "How does PostgreSQL handle transactions?",
    "What is the purpose of indexing in PostgreSQL?",
    "Explain the difference between tablespaces and schemas in PostgreSQL.",
    "How do you optimize PostgreSQL queries for better performance?",
    "What are the different methods for backing up and restoring PostgreSQL databases?",
    "How does PostgreSQL handle user authentication and authorization?",
    "What are the advantages and disadvantages of using PostgreSQL?"
  ],
  "mongodb": [
    "What is MongoDB and how does it differ from traditional relational databases?",
    "Explain the basic structure of a MongoDB database.",
    "What are the different data types supported by MongoDB?",
    "How does MongoDB handle data consistency and durability?",
    "What is the purpose of indexing in MongoDB?",
    "Explain the concept of sharding in MongoDB.",
    "How do you optimize MongoDB queries for better performance?",
    "What are the different methods for backing up and restoring MongoDB databases?",
    "How does MongoDB handle user authentication and authorization?",
    "What are the advantages and disadvantages of using MongoDB?"
  ],
  "redis": [
    "What is Redis and how does it differ from traditional databases?",
    "Explain the key features of Redis.",
    "What are the different data structures supported by Redis?",
    "How does Redis achieve high performance and low latency?",
    "What is data persistence in Redis?",
    "How does Redis handle concurrency and scalability?",
    "What are Redis Pub/Sub and its use cases?",
    "Explain the role of Redis in caching and session management.",
    "What are the advantages and disadvantages of using Redis?",
    "How do you monitor and troubleshoot Redis performance?"
  ]
}
